// 🟢 - прошел
// 🟡 - в работе
// 🔴 - не начинал даже

// 2 ЧАСТЬ
// 2.1 - Создание переменных 🟢
let number = 5,
  str = "Privet";
console.log(number, str);
// 2.2 - Константы (const) и устаревшее var 🟢
let num = 5;
num = Number.parseInt(prompt("Введите свое число: ")); // return int
// num = prompt("Введите свое число: "); // return string
alert(num);
console.log(num);
  // const
  const num1 = 5;

// 2.3 - Правильные названия переменных 🟢

// 2.4 - Строгий режим - use strict 🟢
//    "use strict" - использование более строгого режима в JS
//    (например для таких вещей - number = 5; - сразу выдаст ошибку)

// 2.5 - Стиль кода 🟢

// 2.6 = Отладка кода 🟢