"use strict";

// 5.1 - Логика if-else 🟢

// В целом пока ничего нового.

/* const weaterMap = {
    rainy: "возьмите зонт",
    sunny: "возьмите очки",
    cold: "одевайтесь теплее"
};

console.log(weaterMap[weather] ?? "хорошего вам дня"); */

// const size = prompt("Введите желаемый размер пиццы");
/* const size = "Гегантская";

if(size === null || size === undefined){
    console.log("Вы не выбрали размер!");
}
else{
    const sizeRes = size.trim().toLocaleLowerCase();

    const pizzaSizes = {
        большая:1500,
        средняя: 1200,
        маленькая: 800 
    };

    console.log(pizzaSizes[sizeRes] || "Такого размера у нас нет!");

    const sizeRes = size.trim().toLocaleLowerCase();

    if(sizeRes === "большая"){
        console.log("Большая пицца стоит 1500 руб.");
    } else if(sizeRes === "средняя"){
        console.log("Средняя пицца стоит 1200 руб.");
    } else if(sizeRes === "маленькая"){
        console.log("Маленькая пицца стоит 800 руб.");
    } else{
        console.log("Такого размера у нас нет!");
    }
} */

// попытка во что-то более красивое и сложное
/* const pizzaSizes = {
    большая:1500,
    средняя: 1200,
    маленькая: 800 
}; */

// console.log(pizzaSizes[sizeRes] ?? "Вы не выбрали размер!");

/* if(size === null || size === undefined){
    console.log("Вы не выбрали размер!");
}
else{
    const sizeRes = size.trim().toLocaleLowerCase();

    const pizzaSizes = {
        маленькая: "Маленькая пицца стоит 800 руб.",
        средняя: "Средняя пицца стоит 1200 руб.",
        большая: "Большая пицца стоит 1500 руб.",
    };

    console.log(pizzaSizes[sizeRes] || "Такого размера у нас нет!");
} */

// 5.2 - Тернарный оператор 🟢

/* const userRole = "ADMIN";

// лучше конечно использовать просто - const accessAllowed = userRole === "ADMIN";
// так как у нас и так возвращается булево значение
const accessAllowed = userRole === "ADMIN" ? true : false;

console.log(accessAllowed);

//accessAllowed ? console.log("Доступ разрешен") : console.log("Доступ запрещен");
console.log(accessAllowed ? "Доступ разрешен" : "Доступ запрещен"); */

// тернарный оператор нужно использовать в супер простейших случаях

// 5.3 - Неправильное использование тернарного оператора 🟢

// 5.4 - Конструкция switch 🟢

// 5.5 - Использование switch (true) 🟢

// Оператор Switch создавался для поиска значений из нескольких вариантов записанных в case и при нахождении выполняется определённый код. Можно ли использовать операции сравнения больше, меньше, логические операции и (&&) или (||) в switch?

// Можно, но не в традиционном виде. Это обусловлено правилами выполнения логических операций, или операций сравнения. Рассмотрим фрагмент кода:

/* const num = 10;
  switch (num) {
    case 5 || 10:
    // ...
    case num > 10 && num < 20:
    // ...
    case num > 5:
    // ...
  } */

// Этот код работать не будет. 
// Сперва у нас будет выполнятся код который находится внутри case. 
// Рассмотрим кейсы по очереди. case (5 || 10) можно представить как 
// num === (5 || 10), операция или (||) возвращает нам первое истинное значение, 
// а это 5 и по сути сравниваться будет num === 5, до 10 дело не дойдет 
// и мы ее просто потеряем

// Во втором кейсе результатом логического выражения станет или ложь или истина 
// с которым у нас будет сравниваться num, то есть num === true или false

// В третьем случае тоже результат сравнения с 5 будет правда или ложь 
// и num === (num > 5). 
// Как видим в таком варианте switch не работает. 
// Что можно сделать?

// В switch мы можем заменить num на true и записав case несколько иначе, 
// чтобы все заработало.

/* const num = 7;
switch(true) {
  case num === 5 || num === 10:
    console.log(num); // 5 или 10
    break;
  case num > 10 && num < 20:
    console.log("тоже работает если выполняется case и num !== 5 или num !== 10");
    break;
  case num > 5:
    console.log("это сообщение, если num = (6, 7, 8, 9)");
  } */

// Как как сначала выполняется то что в case, 
// то имеем такое сравнение true === (num === 5 || num === 10) 
// Если в скобках num = 5 или num = 10, результат будет true, 
// true === true и заходим в этот кейс. 
// И так дальше, если результат сравнения в case true, то заходим в этот кейс, 
// если false идем дальше вниз. Не забываем break и все заработает. 
// В JS это работает, но лучше использовать другие методы. 
// Удобство switch в наглядности, недостаток в громоздкости, длинный код, 
// на практике встречается не часто.

// 5.6 - Задача 1 - Тебе нравится JS 🟢

/* const question = prompt("Тебе нравится JavaScript?");

const confirm = ["да", "конечно", "естественно", "yes", "of course", "naturally"];

if (confirm.includes(question.trim().toLocaleLowerCase())){
    alert("Конечно, отличный язык.");
} else{
    alert("Не нравится? Ты че попух?!");
} */

// но лучше сделать через confirm - хотя как по мне это тупо 
// так как там 2 кнопки - ОТМЕНА и ОКЕЙ (и зачем эти кнопки в этой задаче) 

// 5.7 - Задача 2 - Здороваемся по имени 🟢

// Верный способ!!!
/* const myName = prompt("Как тебя зовут?");
if(myName && myName.trim()){
    alert(`Привет, ${myName.trim()}`);
}else{
    alert("Введено неверное имя.");
} */

// alert(myName === "" || myName === null || myName === undefined ? "Введено неверное имя." : `Привет, ${myName}!`);
/* if(myName === "" || myName === null || myName === undefined){
    alert("Введено неверное имя.");
}else{
    alert(`Привет, ${myName}!`);
} */ 
// --> у меня тут ошибка с отработкой кнопки Отмена.

// alt + Z - будет выставлять текст по размеру экрана.

// 5.8 - Задача 3 - Здороваемся по возрасту 🟢

/* const userAge = +prompt("Сколько вам лет? Введите только число.");

if (userAge >= 0 && userAge < 18){
    console.log("Привет :)");
} else if (userAge >= 18 && userAge < 50){
    console.log("Здравствуйте.");
} else if (userAge >= 50 && userAge < 100){
    console.log("Почетный возраст.");
} else if (userAge >= 100){
    console.log("А столько живут?");
}
console.log(userAge); */

// конечно автор в своем решении очень сильно противоречит всему здравому...

// 5.9 - Задача 3 - Здороваемся по возрасту 🟢

/* const nameProduct = prompt("Введите название товара");
const promt = nameProduct.trim().toLocaleLowerCase();

const products = {
  "мышка б54" : 2200,
  "клавиатура к22" : 9400,
  "монитор м123" : 52000
}

alert(!products.includes(promt) ? `Товар ${nameProduct} не найден` : `${nameProduct}: ${products[promt]}`); */
/* if(!nameProduct.includes(promt)) {
  console.log(`Товар ${nameProduct} не найден`);
}else{
  console.log(`${nameProduct}: ${products[promt]}`);
} */

// по итогу все сделали проще -> через switch

// 5.10 - Задача 5 - Отгадай число 🟢

/* const clientNumber = +prompt("Как думаешь какое число?");
const randomNumber = Math.ceil(Math.random() * (5 - 1) + 1);

if(!(clientNumber > 1 && clientNumber <= 5)){
  alert(`Необходимо ввести целое число от 1 до 5 включительно. Ты ввел неверное число - ${clientNumber}`);
} else{
  alert(randomNumber === clientNumber 
    ? "Верно, я загадал число N." 
    : `Нет, не ${clientNumber}, я загадал число ${randomNumber}.`);
} */

// Правильно сказано - сначала проверяем данные, а потом работаем с ними.