"use strict"; // на всякий оставлю тут - из урока 2.4

// 🟢 - прошел
// 🟡 - в работе
// 🔴 - не начинал даже

// 2 ЧАСТЬ
// 2.1 - Создание переменных 🟢
/*let number = 5,
  str = "Privet";
console.log(number, str);*/
// 2.2 - Константы (const) и устаревшее var 🟢
/*let num = 5;
num = Number.parseInt(prompt("Введите свое число: ")); // return int*/
// num = prompt("Введите свое число: "); // return string
/*alert(num);
console.log(num);
  // const
  const num1 = 5;*/

// 2.3 - Правильные названия переменных 🟢

// 2.4 - Строгий режим - use strict 🟢
//    "use strict" - использование более строгого режима в JS
//    (например для таких вещей - number = 5; - сразу выдаст ошибку)

// 2.5 - Стиль кода 🟢

// 2.6 = Отладка кода 🟢

// 3 ЧАСТЬ
// 3.1 - Обзор типов данных  🟢
// 8 типов данных
// number
// string
// bool
// bigInt - большое целое число
// symbol - для объектов
// undefined - типо ничего не определили (определили но ничего не положили в переменную)
// null - значение отсутствует ----> все эти 7 типов - примитивные
// все значения имутабельные
// object - более сложный тип
// 3.2 - Оператор typeof 🟢
// typeof отдает нам строку * "number"
// Нюансы:
// если например в переменной null -> typeof отдает нам object (это ошибка признанная - оставили для обратной совместимости)
// на функцию typeof выдает нам function -> хотя такого типа данных нет
// 3.3 - Тип number 🟢
// стандар IEEE 754 - форма того как будут храниться числа
// нюансы:
/* let million = 1_000_000;
      console.log(million); */

/* let million = 1e6; // единица и 6 нулей - 1_000_000
      console.log(million); */

// можноиспользовать шеснадцатиричную систему счисления
// console.log(0xAB); // 171
// двоичная система
// console.log(0b101010);
// восьмиричная система
// console.log(0o257);

// дробные

// есть в JS также два нуля - 0 и -0 - одинаково воспринимается
// console.log(0);
// console.log(-0);
// 3.4 - Infinity, NaN  превращение числа в строку 🟢
// Мои записи
/* let num = 1;
      let result = num.toString();
      console.log(result); // 1
      console.log(typeof result); // string */

/* let num = 1e1000; // infinity (бесконечнсть)
    console.log(50 / 0); // мде ... можно делить на ноль - тоже infinity
    console.log(50 / -0); // -infinity */

//console(Number.isFinite(1)); // это окончательное число (true/false)
// console.log(50 / "idk");// NaN - no a number (это число?)
// а самый прикол что тип у NaN - number

/* console.log(NaN == NaN); // false --> NaN вообще не равен ничему 
    console.log(Number.isNaN(NaN)); // проверка на NaN */

// String()
/* const num = 52; // да здравствует СПБ
      let result = num.toString();
      console.log(result); // 1
      console.log(typeof result); // string */

// также можно привести в строку такой штукой - num + "" - ну такое себе конечно))))

// const num = 5;
// console.log(Number.isFinite(num)); // Он возвращает true, если num - это число и не равно NaN, Infinity или -Infinity.

// Верно. NaN (Not-a-Number) — это специальное значение, обозначающее результат математической операции,
// которая не имеет смысла (например, 0 / 0). Однако оно принадлежит числовому типу и typeof NaN возвращает "number",
// что является частью стандарта ECMAScript.

// 3.5 -  Превращение строки в число 🟢

/* const str = "52.86";
  console.log(str);
  console.log(+str); // + - унарный плюс (превращает строку в чисто) 
  console.log(Number(str)); // тоже преобразование что и строкой ранее
  // Правила превращения:
  // 1. Пробельные символы будут игнорироваться, но не внутри (эррор)
  console.log(+"   0.43"); // 0.43
  console.log(+"    0. 43    "); // NaN
  // 2. Infinity
  console.log(+"    Infinity "); // Infinity
  // 3. "Он либо все превращает в число, либо ничего"
  console.log(+"  23 rub"); // NaN */

// Также можно преобразовывать при помощи функции.
/* console.log(Number.parseInt("5.4")); // typeof int + отрубает нам дробную часть 
  console.log(Number.parseFloat("5.4")); // typeof float  

  console.log(Number.parseInt("23.4 rub")); // 23
  console.log(Number.parseFloat("23.4 rub")); // 23.4 */

// разница Number.parseInt и Number.parseFloat (работает слева направо)
// и +str - в разнице задач скорее всего, к примеру, если у нас на входе "23px"
// нам +str не пойдет - вернет NaN, а parseInt вернет 23

// console.log(Number.parseInt("10 на 20", 10)); // вторая десятка - это система счисления

// 3.6 - Неточность вычислений 🟢

/* console.log(2 ** 53 - 1);
  console.log(Number.MAX_SAFE_INTEGER); // - тоже самое число 2:17 - стоп пока
  console.log(Number.MAX_VALUE); 
  console.log(Number.MAX_VALUE > Number.MAX_SAFE_INTEGER); // true */

// если делаете что-то с дробями - то округлять нужно, а то капец будет,
// если точно не знаешь что будет выводиться

// 3.7 - Округление чисел 🟢

// defaut ctrl c - console.log();
// round - в большую
// floor - в меньшую
// ceil - вверх
// trunc - обрубает дробную часть

// округление до n знаков
/* console.log(Math.round(24.65452 * 100) / 100); // до 2 знаков - но это чистая математика
  // но есть и готовый вариант:
  console.log((256.24523).toFixed(2)); // 256.24 */

// 3.8 - Максимальное, минимальное и случайные числа 🟢

/* console.log(Math.max(1, 2, 3, -4, 0)); // 3
  console.log(Math.trunc(Math.random() * 10)); // Math.random() => от нуля до единици


  const min = -13
  const max = 13;
  console.log(Math.ceil(Math.random() * (max - min) + min)); // случаное число от min до max */

// 3.9 - String - строки 🟢

// все строки имеют формат UTF 16 и из-за этого есть несколько нюансов
/* const str1 = "";
  const str2 = '';
  let str3 = ``;
  // бектики (backticks) - ``(обратные ковычки) - обычно используется для того чтобы что-то делать в строках.
  str3 = `Это 52 ${5+2}`;
  console.log(str3); 
  // также можно переносить строку обратными ковычками (отображаться будет также):
  const str4 = `
    Привет
    Друг
    !
    Как
    Дела
    ?
  `;
  console.log(str4); */
/* Привет
    Друг
    !
    Как
    Дела
    ? */

// 3.10 - String - поподробнее про строки 🟢
/* const num = 25.25;
  console.log(String(num)); // преобразование в строку, если вдруг не знаем что именно будем преобразовывать
  const str = "SHEEEEESH";
  //console.log(str.length);
  //console.log(str.at(-1)); // получение символов из строки (equals str[1])
  
  // string - immutable
  const str1 = "Привет, друг!";
  const str2 = "Пока" + str1.substring(6);
  console.log(str2);

  // base method
  console.log(str2.toLowerCase());
  console.log(str2.toLocaleLowerCase()); // лучше использовать его, так как больше подходит для всех языков
  const str3 = "  Привет, друг! ";
  console.log(str3.trim());

  console.log(str2.repeat(5)); */

// 3.11 - BigInt - большие целые числа 🟢

/* console.log(Number.MAX_SAFE_INTEGER);
  console.log(Number.MIN_SAFE_INTEGER);

  const numBig = 324342312345245233n;
  console.log(numBig * 123423413412341234n);

  console.log(numBig + BigInt(50)); // преобразование в BitInt

  // BigInt - у нас как целое работает, поэтому при делении у нас дробная часть откидывается
   */

// 3.12 -  Boolean - булев тип данных 🟢

// 3.13 -  Symbol - символ 🟢

// Для создания уникальных значений
//const sym1 = Symbol("hello"); // Symbol("hello")

// Используется с объектами - будем изучать позже,
// так больше вроде как не используется

// 3.14 - null и undefined 🟢

/* let a; 
  console.log(a); // undefined

  let b = null;
  console.log(b); // null - тут все же что-то лежит, а именно null (все же число) */

// 3.15 - Object - объекты 🟢

/* const user = {
    firstName: "Eduard",
    lastName: "N.",
    age: 28
  } */

// 3.16 - Autoboxing 🟢

// При использовании оператора . примитивные значения оборачиваются в объект (Autoboxing).

// null undefined не имеют методов, вообще никаких.

// 4 ЧАСТЬ - ОПЕРАТОРЫ

// 4.1 - Операторы и операнды 🟢

// typeof - это оператор

// 4.2 - Математические операции 🟢

// 4.3 - Конкатенация 🟢

//const num = +prompt("Введите число");
//console.log(`Если к числу ${num} прибавить число 5, то получится ${num + 5}`);

// console.log(50 / "10"); // 5
// console.log("50" * "10"); // 500
// console.log("HI" * "10"); // NaN

// также можно объединять строки и при помощи метода concat()
// - НО: лучше использовать оператор +
/* const str1 = "Вперед, JavaScript";
  const str2 = "сконкатенируй все в этом мире!";
  const str3 = ":)";
  const result = str1.concat(", ", str2, " ", str3);

  console.log(result); // Вывод: Вперед, JavaScript, сконкатенируй все в этом мире! :) */

// 4.4 - Присваивание 🟢

// 4.5 - Инкремент, декремент и запятая 🟢

/* let num1 = 5;
  const prefix = ++num1;
  console.log("num1", num1);
  console.log("prefix", prefix);

  let num2 = 5;
  const postfix = num2++;
  console.log("num2", num2);
  console.log("postfix", postfix);

  // запятая
  let a = 5, b = 10;
  const num = (2 + 2, 3 + 3); // 6 */

// 4.6 - Сравнения 🟢

// Разница между == и === (также != и !==)
//console.log(5 == '2'); // при таком сравнении он превращает
// все в число и сравнивает
//console.log(5 === 2); // при таком сравнении он ничего не превращает
// (он не может сравнить разные типы данных)

// Лучше использовать === по мнению автора

/* Лучше всего избегать неявных преобразований типов - используйте строгие операторы сравнения, это === и !==.
    Если вам нужно более точное сравнение, используйте Object.is(), однако, я настоятельно рекомендую всегда использовать оператор ===.
    */

// Object.is()
// Кроме стандартных операторов сравнения,
// в JavaScript есть метод Object.is(),
// который позволяет сравнивать значения более строго, чем ===.
// Этот метод учитывает некоторые особенности,
// такие как различие между +0 и -0, а также NaN,
// который считается равным только самому себе.
// Например:

/* console.log(0 === -0); // true
  console.log(Object.is(0, -0)); // false

  console.log(NaN === NaN); // false
  console.log(Object.is(NaN, NaN)); // true */

// 4.7 - Сравнение строк 🟢

// помни что строки в UTF 16
/* console.log("Hi" === "Hi"); // true
console.log("a" < "b"); // true

console.log("e".codePointAt(0)); */ // вот как получить код (0 - индекс в строке)

//console.log(String.fromCodePoint(101)); // получитение буквы по коду (e)

// но лучше не сравнивать строки по < > (по === - нормально)
// , например:
//console.log("ё" > "я"); // по идее то ё меньше я, но будет выводить true

// лучше сравнивать по localeCompare
//console.log("ё".localeCompare("я")); // -1
// 1 - если бы ё было больше я
// -1 - если ё меньше я
// 0 - если оба значения равны

// 4.8 - И, Или, Не (AND, OR, NOT) 🟢

/* const a = 5;
console.log(a < 0 || a > 3); // true */

/* const firstName = "Eddy";
const lastName = "Nuss";
console.log(firstName === "Eddy" && lastName === "Nuss"); // true */

// console.log(10 > x > 5);
/* В JavaScript выражение 10 > x > 5 работает не так, 
как может показаться. 
Операции сравнения выполняются слева направо. 
Сначала выполняется 10 > x, что возвращает true (поскольку x = 7).
Затем происходит сравнение true > 5. 
В JavaScript логическое значение true преобразуется в 1, 
и итоговая операция 1 > 5 возвращает false. */

// 4.9 - Нюансы ИЛИ 🟢

/* console.log(`Выражение True || True -> ${true || true}`);
console.log(`Выражение True || False -> ${true || false}`);
console.log(`Выражение False || True -> ${false || true}`);
console.log(`Выражение False || False -> ${false || false}`);

console.log(`Выражение 100 || 0 -> ${100 || 0}`); // 100
// у нас все преобразуется в булев тип данных (например любое число, кроме 0, правдиво)
// * -100 || 0 -> -100
// то есть он смотрит сначала на -100, понимает что это число - оно правдиво
// и все, дальше не идем и возвращает нам число

console.log(`Выражение 10 || 100 -> ${10 || 100}`); // 10 */

// А ЗАЧЕМ?

/* let b = 0;
const num = b || 5;
console.log(num); */

// Пример использования
/* let userName = null;
userName = userName || "Anonim";
console.log(userName); */
// НО ЭТО НЕПОНЯТНО и лучше использовать старое доброе if

// console.log(!0 === true); // true

// 4.10 - Нюансы И 🟢

/* console.log(`Выражение True && True -> ${true && true}`);
console.log(`Выражение True && False -> ${true && false}`);
console.log(`Выражение False && True -> ${false && true}`);
console.log(`Выражение False && False -> ${false && false}`);

// когда мы получаем первую ложь - останавливаемся
// (в отличии от ИЛИ - где мы останавливались где была правда)
console.log(
  `Выражение "50 && "hi" && null && 5" -> ${50 && "hi" && null && 5}`
); // null
console.log(
  `Выражение "50 && "hi" && null && 5" -> ${50 && "hi" && NaN && false}`
); // NaN
console.log(
  `Выражение "50 && "hi" && null && 5" -> ${50 && "hi" && true && 5}`
); // 5 (выводим последнее - так как все правдивые) */

// exapmle
/* const userRole = "Администратор";
userRole === "Администратор" && console.log("Ты можешь все!"); // Ты можешь все! */

// для понятности пока лучше опять же через if()
/* 
let userRole = "Администратор";
//userRole &&= `${userRole} - красавчик!`; // equals userRole && `${userRole} - красавчик!`
userRole = userRole && `${userRole} - красавчик!`
console.log(userRole); */

// 4.11 - ?? - оператор нулевого слияния 🟢

/* const userName = prompt("Введите ваше имя");
console.log(`Привет, ${userName || "Аноним"}`); */

/* const messageCount = 0;
// к примеру - если у нас в messageCount будет 0,
// и у нас в выражении будет логическое ИЛИ, то мы получим "неизвестно",
// так как 0 это false.
// А я бы хотел число
console.log(
  //   `Количество непрочитанных сообщений: ${messageCount || "неизвестно"}`
  `Количество непрочитанных сообщений: ${messageCount && "неизвестно"}`
); */
// ?? - если слева не null или не undefined - то используем это значение

// НЕЛЬЗЯ ЭТОТ ОПЕРАТОР ИСПОЛЬЗОВАТЬ С ОПЕРАТОРОМ ЛОГИЧЕСКИМ
// (Нужно использовать скобки для того чтобы не было ошибки)

// 4.12 - ?? - оператор нулевого слияния 🟡🟢
